lepton-phlb/nuodio.scion/bsp/prototyp.1/scion/sys/root/src/kernel/dev/bsp/hybrid_tube/dev_hybrid_tube_peripherals/dev_stm32f4xx_i2s_3.c
/*
The contents of this file are subject to the Mozilla Public License Version 1.1
(the "License"); you may not use this file except in compliance with the License.
You may obtain a copy of the License at http://www.mozilla.org/MPL/

Software distributed under the License is distributed on an "AS IS" basis,
WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License for the
specific language governing rights and limitations under the License.

The Original Code is Lepton.

The Initial Developer of the Original Code is Philippe Le Boulanger.
Portions created by Philippe Le Boulanger are Copyright (C) 2015 <lepton.phlb@gmail.com>.
All Rights Reserved.

Contributor(s): Jean-Jacques Pitrolle <lepton.jjp@gmail.com>.

Alternatively, the contents of this file may be used under the terms of the eCos GPL license
(the  [eCos GPL] License), in which case the provisions of [eCos GPL] License are applicable
instead of those above. If you wish to allow use of your version of this file only under the
terms of the [eCos GPL] License and not to allow others to use your version of this file under
the MPL, indicate your decision by deleting  the provisions above and replace
them with the notice and other provisions required by the [eCos GPL] License.
If you do not delete the provisions above, a recipient may use your version of this file under
either the MPL or the [eCos GPL] License."
*/


/*============================================
| Includes
==============================================*/
#include <stdint.h>

#include "kernel/core/kernelconf.h"
#include "kernel/core/types.h"
#include "kernel/core/interrupt.h"
#include "kernel/core/kernel.h"
#include "kernel/core/system.h"
#include "kernel/core/malloc.h"
#include "kernel/core/ioctl.h"
#include "kernel/core/ioctl_spi.h"
#include "kernel/core/fcntl.h"
#include "kernel/core/stat.h"
#include "kernel/core/cpu.h"
#include "kernel/fs/vfs/vfstypes.h"
#include "kernel/core/kernel_ring_buffer.h"

#include "kernel/dev/bsp/hybrid_tube/cubemx_hal/gpio.h"

//#include "kernel/dev/bsp/hybrid_tube/dev_hybrid_tube_peripherals/dev_stm32f4xx_i2s_3.h"

/*============================================
| Global Declaration
==============================================*/

#include "stm32f4xx_hal.h"

#define SAMPLES_PER_BUFFER 48//((48)*2) //32

#pragma data_alignment=4 
static int32_t RxBuffer[SAMPLES_PER_BUFFER * 2]={0};//RX is receive of input audio from codec
#pragma data_alignment=4 
static int32_t TxBuffer[SAMPLES_PER_BUFFER * 2]={0};//TX is transmit of output audio to codec
//#pragma data_alignment=4 
//static int32_t WorkingBuffer[SAMPLES_PER_BUFFER * 2]={0};


typedef struct stm32f4xx_i2s_3_info_st{
  
 desc_t desc_r;
 desc_t desc_w; 
 I2S_HandleTypeDef hi2s3;
 DMA_HandleTypeDef hdma_i2s3_ext_rx;
 DMA_HandleTypeDef hdma_spi3_tx;
 
}stm32f4xx_i2s_3_info_t;

#pragma data_alignment=4 
static stm32f4xx_i2s_3_info_t g_stm32f4xx_i2s_3_info;

const char dev_stm32f4xx_i2s_3_name[]="i2s3\0";

int dev_stm32f4xx_i2s_3_load(void);
int dev_stm32f4xx_i2s_3_open(desc_t desc, int o_flag);
int dev_stm32f4xx_i2s_3_close(desc_t desc);
int dev_stm32f4xx_i2s_3_isset_read(desc_t desc);
int dev_stm32f4xx_i2s_3_isset_write(desc_t desc);
int dev_stm32f4xx_i2s_3_read(desc_t desc, char* buf,int size);
int dev_stm32f4xx_i2s_3_write(desc_t desc, const char* buf,int size);
int dev_stm32f4xx_i2s_3_seek(desc_t desc,int offset,int origin);
int dev_stm32f4xx_i2s_3_ioctl(desc_t desc,int request,va_list ap);


dev_map_t dev_stm32f4xx_i2s_3_map={
   dev_stm32f4xx_i2s_3_name,
   S_IFCHR,
   dev_stm32f4xx_i2s_3_load,
   dev_stm32f4xx_i2s_3_open,
   dev_stm32f4xx_i2s_3_close,
   dev_stm32f4xx_i2s_3_isset_read,
   dev_stm32f4xx_i2s_3_isset_write,
   dev_stm32f4xx_i2s_3_read,
   dev_stm32f4xx_i2s_3_write,
   dev_stm32f4xx_i2s_3_seek,
   dev_stm32f4xx_i2s_3_ioctl //ioctl
};

//
#define I2S_AUDIO_CHANNEL_MAX           2

#define I2S_AUDIO_CHANNEL_ADC_INPUT     0
#define I2S_AUDIO_CHANNEL_ADC_INPUT_SZ  ((SAMPLES_PER_BUFFER*4)*sizeof(int32_t))

#define I2S_AUDIO_CHANNEL_DAC_OUTPUT    1
#define I2S_AUDIO_CHANNEL_DAC_OUTPUT_SZ ((SAMPLES_PER_BUFFER*4)*sizeof(int32_t))

#pragma data_alignment=4
static uint8_t i2s_audio_channel_adc_input_buffer[I2S_AUDIO_CHANNEL_ADC_INPUT_SZ]={0};

#pragma data_alignment=4
static uint8_t i2s_audio_channel_dac_output_buffer[I2S_AUDIO_CHANNEL_DAC_OUTPUT_SZ]={0};


static kernel_ring_buffer_t krb_i2s_audio_channel_adc_input;
static kernel_ring_buffer_t krb_i2s_audio_channel_dac_output;


//
void I2S2_RX_ProcessBuffer(uint32_t posbegin, uint32_t posend){
   //
   if(__kernel_ring_buffer_is_empty(krb_i2s_audio_channel_adc_input)){
      __fire_io_int(ofile_lst[g_stm32f4xx_i2s_3_info.desc_r].owner_pthread_ptr_read);
   }
   //write data from adc to ring buffer
   kernel_ring_buffer_write(&krb_i2s_audio_channel_adc_input,(uint8_t*)&RxBuffer[posbegin],(posend-posbegin)*sizeof(int32_t));
                            
   //read data from ring buffer to dac
   kernel_ring_buffer_read(&krb_i2s_audio_channel_dac_output,(uint8_t*)&TxBuffer[posbegin],(posend-posbegin)*sizeof(int32_t));
                            
}

void HAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s){
   //refill buffer HALF - END
   if(hi2s->Instance == SPI3){
      I2S2_RX_ProcessBuffer(SAMPLES_PER_BUFFER,SAMPLES_PER_BUFFER*2);
   }
 
}

void HAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s){
   //refill buffer BEGIN - HALF
   if(hi2s->Instance == SPI3){
      I2S2_RX_ProcessBuffer(0,SAMPLES_PER_BUFFER);
   }
 
}

void HAL_I2S_ErrorCallback(I2S_HandleTypeDef *hi2s)
{
  uint32_t status = hi2s->Instance->SR;
  if(status & 0x40) {
      __HAL_I2S_CLEAR_OVRFLAG(hi2s);
  }
  if(status & 0x08) {
      __HAL_I2S_CLEAR_UDRFLAG(hi2s);
  }
   if(status & 0x100){
     __HAL_I2S_DISABLE(hi2s);
    __HAL_I2S_ENABLE(hi2s);
  }
}

/**
* @brief This function handles DMA1 Stream0 global interrupt.
*/
void DMA1_Stream0_IRQHandler(void)
{
  /* USER CODE BEGIN DMA1_Stream0_IRQn 0 */
  __hw_enter_interrupt();
  /* USER CODE END DMA1_Stream0_IRQn 0 */
  HAL_DMA_IRQHandler(&g_stm32f4xx_i2s_3_info.hdma_i2s3_ext_rx);
  /* USER CODE BEGIN DMA1_Stream0_IRQn 1 */
  __hw_leave_interrupt();
  /* USER CODE END DMA1_Stream0_IRQn 1 */
}

/**
* @brief This function handles DMA1 Stream5 global interrupt.
*/
void DMA1_Stream5_IRQHandler(void)
{
  /* USER CODE BEGIN DMA1_Stream5_IRQn 0 */
  __hw_enter_interrupt();
  /* USER CODE END DMA1_Stream5_IRQn 0 */
  HAL_DMA_IRQHandler(&g_stm32f4xx_i2s_3_info.hdma_spi3_tx);
  /* USER CODE BEGIN DMA1_Stream5_IRQn 1 */
   __hw_leave_interrupt();
  /* USER CODE END DMA1_Stream5_IRQn 1 */
}

void SPI3_IRQHandler(void) {
//  uint16_t t = I2SxEXT(hi2s2.Instance)->DR;
//  uint16_t tmpreg1 = I2SxEXT(hi2s2.Instance)->SR;
//  if(hi2s2.Lock != HAL_LOCKED) {
    HAL_I2S_IRQHandler(&g_stm32f4xx_i2s_3_info.hi2s3);
 
