lepton-phlb/nuodio.scion/bsp/prototyp.1/scion/sys/root/src/kernel/dev/bsp/hybrid_tube/dev_hybrid_tube_peripherals/dev_stm32f4xx_i2s_3.c
      /* Check if the I2S is already enabled */ 
      if((hi2s->Instance->I2SCFGR &SPI_I2SCFGR_I2SE) != SPI_I2SCFGR_I2SE)
      {
          //WS issue workaround: to do move in HAL_I2SEx_TransmitReceive_DMA() 
          __disable_interrupt_section_in();
          WaitForWCLK(0);
          WaitForWCLK(1);
         /* Enable I2S peripheral after the I2Sext */
         __HAL_I2S_ENABLE(hi2s);
         //
         __disable_interrupt_section_out();

        /* Enable I2Sext(transmitter) after enabling I2Sx peripheral */
        I2SxEXT(hi2s->Instance)->I2SCFGR |= SPI_I2SCFGR_I2SE;
      }
      else
      {
        /* Check if Master Receiver mode is selected */
        if((hi2s->Instance->I2SCFGR & SPI_I2SCFGR_I2SCFG) == I2S_MODE_MASTER_RX)
        {
          /* Clear the Overrun Flag by a read operation on the SPI_DR register followed by a read
          access to the SPI_SR register. */ 
          __HAL_I2S_CLEAR_OVRFLAG(hi2s);
        }
      }
    }

    /* Process Unlocked */
    __HAL_UNLOCK(hi2s);

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/*-------------------------------------------
| Name:MX_I2S3_Init
| Description:
| Parameters:
| Return Type:
| Comments:
| See:
---------------------------------------------*/
static void MX_I2S3_Init(void)
{ 
  //
  g_stm32f4xx_i2s_3_info.hi2s3.Instance = SPI3;
  g_stm32f4xx_i2s_3_info.hi2s3.Init.Mode = I2S_MODE_SLAVE_TX;
  g_stm32f4xx_i2s_3_info.hi2s3.Init.Standard = I2S_STANDARD_PHILLIPS;
  g_stm32f4xx_i2s_3_info.hi2s3.Init.DataFormat = I2S_DATAFORMAT_24B;//I2S_DATAFORMAT_32B;
  g_stm32f4xx_i2s_3_info.hi2s3.Init.MCLKOutput = I2S_MCLKOUTPUT_DISABLE;
  g_stm32f4xx_i2s_3_info.hi2s3.Init.AudioFreq = I2S_AUDIOFREQ_48K;
  g_stm32f4xx_i2s_3_info.hi2s3.Init.CPOL = I2S_CPOL_LOW;
  g_stm32f4xx_i2s_3_info.hi2s3.Init.ClockSource = I2S_CLOCK_PLL;
  g_stm32f4xx_i2s_3_info.hi2s3.Init.FullDuplexMode = I2S_FULLDUPLEXMODE_ENABLE;
  HAL_I2S_Init(&g_stm32f4xx_i2s_3_info.hi2s3);

}

/*-------------------------------------------
| Name:HAL_I2S3_MspInit
| Description:
| Parameters:
| Return Type:
| Comments:
| See:
---------------------------------------------*/
static void HAL_I2S3_MspInit(stm32f4xx_i2s_3_info_t* stm32f4xx_i2s_3_info)
{  
   GPIO_InitTypeDef GPIO_InitStruct;

   /* USER CODE BEGIN SPI3_MspInit 0 */

   /* USER CODE END SPI3_MspInit 0 */
   /* Peripheral clock enable */
   __SPI3_CLK_ENABLE();

   /**I2S3 GPIO Configuration    
   PC7     ------> I2S3_MCK
   PA15     ------> I2S3_WS
   PD6     ------> I2S3_SD
   PB3     ------> I2S3_CK
   PB4     ------> I2S3_ext_SD 
   */
   /*
   GPIO_InitStruct.Pin = GPIO_PIN_7;
   GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
   GPIO_InitStruct.Pull = GPIO_NOPULL;
   GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
   GPIO_InitStruct.Alternate = GPIO_AF6_SPI3;
   HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
   */
   
   GPIO_InitStruct.Pin = GPIO_PIN_15;
   GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
   GPIO_InitStruct.Pull = GPIO_NOPULL;
   GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
   GPIO_InitStruct.Alternate = GPIO_AF6_SPI3;
   HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

   GPIO_InitStruct.Pin = GPIO_PIN_6;
   GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
   GPIO_InitStruct.Pull = GPIO_NOPULL;
   GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
   GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
   HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

   GPIO_InitStruct.Pin = GPIO_PIN_3;
   GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
   GPIO_InitStruct.Pull = GPIO_NOPULL;
   GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
   GPIO_InitStruct.Alternate = GPIO_AF6_SPI3;
   HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

   GPIO_InitStruct.Pin = GPIO_PIN_4;
   GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
   GPIO_InitStruct.Pull = GPIO_NOPULL;
   GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
   GPIO_InitStruct.Alternate = GPIO_AF7_I2S3ext;
   HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

   /* Peripheral DMA init*/

   stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx.Instance = DMA1_Stream0;
   stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx.Init.Channel = DMA_CHANNEL_3;
   stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
   stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx.Init.PeriphInc = DMA_PINC_DISABLE;
   stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx.Init.MemInc = DMA_MINC_ENABLE;
   stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
   stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
   stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx.Init.Mode = DMA_CIRCULAR;
   stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx.Init.Priority = DMA_PRIORITY_VERY_HIGH;
   stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
   stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_HALFFULL;
   stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx.Init.MemBurst = DMA_MBURST_SINGLE;//DMA_MBURST_INC4;
   stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx.Init.PeriphBurst = DMA_PBURST_SINGLE;//DMA_PBURST_INC4;
   HAL_DMA_Init(&stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx);

   __HAL_LINKDMA(&stm32f4xx_i2s_3_info->hi2s3,hdmarx,stm32f4xx_i2s_3_info->hdma_i2s3_ext_rx);

   stm32f4xx_i2s_3_info->hdma_spi3_tx.Instance = DMA1_Stream5;
   stm32f4xx_i2s_3_info->hdma_spi3_tx.Init.Channel = DMA_CHANNEL_0;
   stm32f4xx_i2s_3_info->hdma_spi3_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
   stm32f4xx_i2s_3_info->hdma_spi3_tx.Init.PeriphInc = DMA_PINC_DISABLE;
   stm32f4xx_i2s_3_info->hdma_spi3_tx.Init.MemInc = DMA_MINC_ENABLE;
   stm32f4xx_i2s_3_info->hdma_spi3_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
   stm32f4xx_i2s_3_info->hdma_spi3_tx.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
   stm32f4xx_i2s_3_info->hdma_spi3_tx.Init.Mode = DMA_CIRCULAR;
   stm32f4xx_i2s_3_info->hdma_spi3_tx.Init.Priority = DMA_PRIORITY_VERY_HIGH;
   stm32f4xx_i2s_3_info->hdma_spi3_tx.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
   stm32f4xx_i2s_3_info->hdma_spi3_tx.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_HALFFULL;
   stm32f4xx_i2s_3_info->hdma_spi3_tx.Init.MemBurst = DMA_MBURST_SINGLE;//DMA_MBURST_INC4;
   stm32f4xx_i2s_3_info->hdma_spi3_tx.Init.PeriphBurst =  DMA_PBURST_SINGLE;//DMA_PBURST_INC4;
   HAL_DMA_Init(&stm32f4xx_i2s_3_info->hdma_spi3_tx);

   __HAL_LINKDMA(&stm32f4xx_i2s_3_info->hi2s3,hdmatx,stm32f4xx_i2s_3_info->hdma_spi3_tx);
}

/*-------------------------------------------
| Name:dev_stm32f4xx_i2s_3_load
| Description:
| Parameters:
| Return Type:
| Comments:
| See:
---------------------------------------------*/
int dev_stm32f4xx_i2s_3_load(){
   //
   g_stm32f4xx_i2s_3_info.desc_r = INVALID_DESC;
   g_stm32f4xx_i2s_3_info.desc_w = INVALID_DESC;
   //
   //MX_I2S3_Init();
   //
   kernel_ring_buffer_init(&krb_i2s_audio_channel_adc_input,i2s_audio_channel_adc_input_buffer,I2S_AUDIO_CHANNEL_ADC_INPUT_SZ);
   kernel_ring_buffer_init(&krb_i2s_audio_channel_dac_output,i2s_audio_channel_dac_output_buffer,I2S_AUDIO_CHANNEL_DAC_OUTPUT_SZ);
   //
   return 0;
}

/*-------------------------------------------
| Name:dev_stm32f4xx_i2s_3_open
| Description:
| Parameters:
| Return Type:
| Comments:
| See:
---------------------------------------------*/
int dev_stm32f4xx_i2s_3_open(desc_t desc, int o_flag){

   //
   if(g_stm32f4xx_i2s_3_info.desc_r<0 && g_stm32f4xx_i2s_3_info.desc_w<0) {
      //
      HAL_StatusTypeDef status;
      /* DMA controller clock enable */
      __DMA1_CLK_ENABLE();
      
      //
      //
      HAL_I2S3_MspInit(&g_stm32f4xx_i2s_3_info);
      MX_I2S3_Init();
      //
      __HAL_I2S_DISABLE(&g_stm32f4xx_i2s_3_info.hi2s3);
      
      g_stm32f4xx_i2s_3_info.hdma_spi3_tx.Init.Channel = DMA_CHANNEL_0;
      HAL_DMA_Init(&g_stm32f4xx_i2s_3_info.hdma_spi3_tx);
     __HAL_LINKDMA(&g_stm32f4xx_i2s_3_info.hi2s3,hdmatx,g_stm32f4xx_i2s_3_info.hdma_spi3_tx);
      
      /* DMA interrupt init */
      //HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, 0, 0);
      NVIC_SetPriority(DMA1_Stream0_IRQn, (1 << __NVIC_PRIO_BITS) -3);
      HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);
      //
      //HAL_NVIC_SetPriority(DMA1_Stream5_IRQn, 0, 0);
      NVIC_SetPriority(DMA1_Stream5_IRQn, (1 << __NVIC_PRIO_BITS) -3);
      HAL_NVIC_EnableIRQ(DMA1_Stream5_IRQn);
      //
      __HAL_I2S_ENABLE_IT(&g_stm32f4xx_i2s_3_info.hi2s3, I2S_IT_TXE);
      __HAL_I2S_ENABLE_IT(&g_stm32f4xx_i2s_3_info.hi2s3, I2S_IT_RXNE);
      __HAL_I2S_ENABLE_IT(&g_stm32f4xx_i2s_3_info.hi2s3, I2S_IT_ERR);
      //
      status = HAL_I2SEx_TransmitReceive_DMA_Workaround(&g_stm32f4xx_i2s_3_info.hi2s3, (uint16_t*)&TxBuffer[0], (uint16_t*)&RxBuffer[0], SAMPLES_PER_BUFFER * 2);
      //
   }
  //
   if(o_flag & O_RDONLY) {
      if(g_stm32f4xx_i2s_3_info.desc_r<0) {
         g_stm32f4xx_i2s_3_info.desc_r = desc;
      }
      else
         return -1;                //already open
   }

