lepton-phlb/nuodio.scion/bsp/prototyp.1/scion/sys/root/src/kernel/dev/bsp/hybrid_tube/dev_hybrid_tube_peripherals/dev_stm32f4xx_i2s_3.c
   if(o_flag & O_WRONLY) {
      if(g_stm32f4xx_i2s_3_info.desc_w<0) {
         g_stm32f4xx_i2s_3_info.desc_w = desc;
      }
      else
         return -1;                //already open
   }
   //
   if(!ofile_lst[desc].p)
      ofile_lst[desc].p=&g_stm32f4xx_i2s_3_info;
   //
   return 0;

}

/*-------------------------------------------
| Name:dev_stm32f4xx_i2s_3_close
| Description:
| Parameters:
| Return Type:
| Comments:
| See:
---------------------------------------------*/
int dev_stm32f4xx_i2s_3_close(desc_t desc){

   return 0;
}

/*-------------------------------------------
| Name:dev_stm32f4xx_i2s_3_isset_read
| Description:
| Parameters:
| Return Type:
| Comments:
| See:
---------------------------------------------*/
int dev_stm32f4xx_i2s_3_isset_read(desc_t desc){
   if(__kernel_ring_buffer_is_not_empty(krb_i2s_audio_channel_adc_input)){
      return 0;
   }
   return -1;
}

/*-------------------------------------------
| Name:dev_stm32f4xx_i2s_3_isset_write
| Description:
| Parameters:
| Return Type:
| Comments:
| See:
---------------------------------------------*/
int dev_stm32f4xx_i2s_3_isset_write(desc_t desc){
   //if(audio_ring_buffer_channel[I2S_AUDIO_CHANNEL_DAC_OUTPUT].r==audio_ring_buffer_channel[I2S_AUDIO_CHANNEL_DAC_OUTPUT].w){
   //return 0;
   //}
   //return -1;
   return 0;
}
/*-------------------------------------------
| Name:dev_stm32f4xx_i2s_3_read
| Description:
| Parameters:
| Return Type:
| Comments:
| See:
---------------------------------------------*/
int dev_stm32f4xx_i2s_3_read(desc_t desc, char* buf,int size){
  return kernel_ring_buffer_read(&krb_i2s_audio_channel_adc_input,(uint8_t*)buf,size);  
}

/*-------------------------------------------
| Name:dev_stm32f4xx_i2s_3_write
| Description:
| Parameters:
| Return Type:
| Comments:
| See:
---------------------------------------------*/
int dev_stm32f4xx_i2s_3_write(desc_t desc, const char* buf,int size){
   int cb = kernel_ring_buffer_write(&krb_i2s_audio_channel_dac_output,(uint8_t*)buf,size);
   if(cb>0){
      __fire_io_int(ofile_lst[g_stm32f4xx_i2s_3_info.desc_w].owner_pthread_ptr_write);
   }
   return cb;
}

/*-------------------------------------------
| Name:dev_stm32f4xx_i2s_3_seek
| Description:
| Parameters:
| Return Type:
| Comments:
| See:
---------------------------------------------*/
int dev_stm32f4xx_i2s_3_seek(desc_t desc,int offset,int origin){
   return -1;
}

/*-------------------------------------------
| Name:dev_stm32f4xx_i2s_3_ioctl
| Description: ex: mount /dev/stm32f4xx_i2s_3 /dev/spi0 /dev/g_in 0 e.15 f.2 f.5 (a0, cs, shdn, pr)
| Parameters:
| Return Type:
| Comments:
| See:
---------------------------------------------*/

int dev_stm32f4xx_i2s_3_ioctl(desc_t desc,int request,va_list ap){
   switch(request) {
     
      case I_LINK: {
      }
      break;

      //
      case I_UNLINK: {
      }
      break;
      
      //
      default:
         return -1;

   }
   //
   return 0;
}


/*============================================
| End of Source  : dev_stm32f4xx_i2s_3.c
==============================================*/
